#include<iostream>
using std::cout;
using std::endl;

void show_info()
{
    cout<<"********************************************************************\n";

    cout<<"本程序用以处理大物/普物实验中的不确定度计算，实验标准差计算等过程"<<endl;
    cout<<"作者为**武汉大学**物理科学与技术学院**2021级**奚志坤**"<<endl;
    cout<<"Powered by Zed"<<endl;
    cout<<"********************************************************************"<<endl<<endl;

    cout<<"*********************************************\n";
    cout<<"使用说明：\n";
    cout<<"1.数据结果默认显示6位小数，自动省略末尾的0\n";
    cout<<"2.在读入数据时，后面不要带单位，单位是单独输入的，只需输入一次,输入的数据请与输入的单位保持一致"<<endl;
    cout<<"3.输入公式时，系数和物理量之间请用“ * ”连接，不能省略乘号！"<<endl;
    cout<<"4.默认SI(国际单位制)，需要单位转换请期待后续版本。"<<endl;
    cout<<"5.如果公式中存在分母，请一定要用括号括起整个分母！"<<endl;
    cout<<"6.如果需要输入根号，请以指数代替，如根号下x以x^(1/2)代替。"<<endl;
    cout<<"*********************************************"<<endl;
}
